$('#myJD').addDropdown({
    href: '#',
    title: "我的京东",
    width: 126,
    menuList: [{
        title: "",
        items: [{
            href: '#',
            name: '待处理订单'
        }, {
            href: '#',
            name : '返修退换货',
        }, {
            href: '#',
            name: '降价商品'
        }, {
            href: '#',
            name: '消息'
        }, {
            href: '#',
            name: '我的问答'
        }, {
            href: '#',
            name: '我的关注'
        }],
    }, {
        title: '',
        items: [{
            href: '#',
            name: '我的京豆'
        }, {
            href: '#',
            name: '我的优惠券'
        }, {
            href: '#',
            name: '我的白条'
        }, {
            href: '#',
            name: '我的理财'
        }],
    }]
});

$('#procurement').addDropdown({
    title: '企业采购',
    width: 56,
    menuList: [{
        title: '',
        items: [{
            href: '#',
            name: '企业购'
        }, {
            href: '#',
            name : '商用场景观',
        }, {
            href: '#',
            name: '工业品'
        }, {
            href: '#',
            name : '丰客多商城',
        },{
            href: '#',
            name: '礼品卡'
        },{
            href: '#',
            name : '微信企业购',
        }]
    }]
});


$('#service').addDropdown({
    title: '客户服务',
    width: 70,
    menuList: [{
        title: '客户',
        items: [{
            href: '#',
            name: '帮助中心'
        }, {
            href: '#',
            name : '售后服务',
        }, {
            href: '#',
            name: '在线客服'
        }, {
            href: '#',
            name: '意见建议'
        }, {
            href: '#',
            name: '电话客服'
        }, {
            href: '#',
            name: '客服邮箱'
        }, {
            href: '#',
            name :'金融咨询'
        }, {
            href: '#',
            name: '全球售客服'
        }, {
            href: '#',
            name: '企业服务'
        }]
    }, {
        title: '商户',
        items: [{
            href: '#',
            name: '帮助中心'
        }, {
            href: '#',
            name : '售后服务',
        }, {
            href: '#',
            name: '在线客服'
        }, {
            href: '#',
            name: '意见建议'
        }, {
            href: '#',
            name: '电话客服'
        }, {
            href: '#',
            name: '客服邮箱'
        }, {
            href: '#',
            name :'金融咨询'
        }, {
            href: '#',
            name: '全球售客服'
        }]
    }]
});


$('#bar-navs').addDropdown({
    title: '网站导航',
    direction: 'x',
    menuList: [{
        title: '特色主题',
        width: 340,
        itemWidth: 85,
        items: [{
            href: '#',
            name: '新品首发'
        }, {
            href: '#',
            name : '京东金融',
        }, {
            href: '#',
            name: '全球售'
        }, {
            href: '#',
            name: '国际站'
        }, {
            href: '#',
            name: '京东会员'
        }, {
            href: '#',
            name: '京东预售'
        }, {
            href: '#',
            name :'台湾售'
        }, {
            href: '#',
            name: '俄语站'
        },{
            href: '#',
            name: '装机大师'
        }, {
            href: '#',
            name : '0元评测',
        }, {
            href: '#',
            name: '港澳售'
        }, {
            href: '#',
            name: '优惠券'
        }, {
            href: '#',
            name: '秒杀'
        }, {
            href: '#',
            name: '闪购'
        }, {
            href: '#',
            name :'印尼站'
        }, {
            href: '#',
            name: '陪伴计划'
        }, {
            href: '#',
            name: '出海招商'
        }, {
            href: '#',
            name :'拍拍二手'
        }, {
            href: '#',
            name: '买什么'
        } ]
    }, {
        title: '行业频道',
        width: 270,
        itemWidth: 85,
        items: [{
            href: '#',
            name: '手机'
        }, {
            href: '#',
            name : '智能数码',
        }, {
            href: '#',
            name: '玩3C'
        }, {
            href: '#',
            name: '电脑办公'
        }, {
            href: '#',
            name: '家用电器'
        }, {
            href: '#',
            name: '京鱼座智能'
        }, {
            href: '#',
            name :'京东服饰'
        }, {
            href: '#',
            name: '京东生鲜'
        },{
            href: '#',
            name: '家装城'
        }, {
            href: '#',
            name: '母婴'
        }, {
            href: '#',
            name :'食品'
        }, {
            href: '#',
            name: '农资频道'
        },{
            href: '#',
            name: '整车'
        }, {
            href: '#',
            name: '图书'
        }, {
            href: '#',
            name :'劳动防护'
        }]
    }, {
        title: '生活服务',
        width: 270,
        itemWidth: 85,
        items: [{
            href: '#',
            name: '京东众筹'
        }, {
            href: '#',
            name : '白条',
        }, {
            href: '#',
            name: '京东金融APP'
        }, {
            href: '#',
            name: '京东小金库'
        }, {
            href: '#',
            name: '理财'
        }, {
            href: '#',
            name: '话费'
        }, {
            href: '#',
            name :'水电煤'
        }, {
            href: '#',
            name: '彩票'
        }, {
            href: '#',
            name: '旅行'
        }, {
            href: '#',
            name: '机票酒店'
        }, {
            href: '#',
            name: '电影票'
        }, {
            href: '#',
            name: '京东到家'
        }, {
            href: '#',
            name :'游戏'
        }, {
            href: '#',
            name: '拍拍回收'
        }]
    }, {
        title: '更多精彩',
        width: 226,
        itemWidth: 85,
        items: [{
            href: '#',
            name: '合作招商'
        }, {
            href: '#',
            name : '京东通信',
        },{
            href: '#',
            name : '白东E卡',
        }, {
            href: '#',
            name: '企业采购'
        }, {
            href: '#',
            name: '服务市场'
        }, {
            href: '#',
            name: '办公生活馆'
        }, {
            href: '#',
            name: '校园加盟'
        }, {
            href: '#',
            name :'京东社区'
        }, {
            href: '#',
            name: '游戏社区'
        }, {
            href: '#',
            name: '知识产权维权'
        }]
    }]
});





        

        
// });


var menuList = [{
    title: ['家用电器'],
    content: {
        tabs: ['家用电馆','家电专卖店','家电服务','企业采购','商用电器','以旧换新'],
        subs: [{
            title: '电视',
            items: ["超薄电视","全面屏电视","智能电视","教育电视","OLED电视","智慧屏","4K超清电视","55英寸","65英寸","电视配件"]
        }, {
            title: '空调',
            items: ["空调挂机", "空调柜机", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }, {
            title: '洗衣机',
            items: ["滚筒洗衣机", "洗烘—体机","波轮洗衣机","迷你洗衣机","烘干机","洗衣机配件"]
        }, {
            title: '冰箱',
            items: ["多门","对开门","三门","双门","冷柜/冰吧","酒柜","冰箱配件"]
        }, {
            title: '厨卫大电',
            items: ["油烟机","燃气灶","烟灶套装","集成灶","消毒柜","洗碗机","电热水器","燃气热水器","空气能热水器","太阳能热水器","嵌入式厨电","烟机灶具配件"]
        }, {
            title: '厨卫小电',
            items: ["破壁机","电烤箱","电饭煲","电压力锅","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机/原汁机","电水壶/热水瓶","微波炉","电热饭盒","电火锅养生壶","电磁炉","面包机","空气炸锅","面条机","电陶炉","煮蛋器","电烧烤炉"]
        }, {
            title: '生活电器',
            items: ["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件"]
        }, {
            title: '各户健康',
            items: ["剃须刀", "电动牙刷", "电吹风", "美容仪", "美容仪", "洁面仪","按摩器","健康秤卷","直发器剃","脱毛器","理发器","足浴盆","足疗机","按摩椅"]
        }, {
            title: '试听影音',
            items: ["家庭影院", "KTV音响", "迷你音响", "功放", "洗麦克风"]
        }]
    }
}, {
    title: ['手机', '运营商', '数码'],
    content: {
        tabs: ['玩3C','手机频道','网上营业厅','配件频道','智能数码','影响Club'],
        subs: [{
            title: '手机通讯',
            items: ["手机游戏","5G手机","拍照手机","全面屏手机","老人机","对讲机","以旧换新","手机维修"]
        }, {
            title: '运行商',
            items: ["合约机","手机卡","宽带","充话费/流量","中国电信","中国移动","中国联通","京东通信","找靓号"]
        }, {
            title: '手机配件',
            items: ["手机壳","贴膜","手机存储卡","数据线","充电器","手机","耳机","创意配件","手机饰品","手机电池","苹果周边","移动电源","蓝牙耳机","手机支架","拍照配件"]
        }, {
            title: '摄影摄像',
            items: ["数码相机","微单相机","单反相机","拍立得","运动相机","摄像机镜头","户外器材","影棚器材","冲印服务","数码相框"]
        }, {
            title: '数码配件',
            items: ["存储卡","三脚架/云台","相机包","滤镜","闪光灯/手柄","相机清洁/贴膜","机身附件","镜头附件","读卡器","支架","电池/充电器"]
        }, {
            title: '影音娱乐',
            items: ["耳机/耳麦","音箱/音响","智能音箱","收音机","麦克风","MP3/MP4","专业音频","音频线"]
        }, {
            title: '智能设备',
            items: ["智能手环","智能手表","智能眼镜","智能机器人","运动跟踪器","健康监测","智能配饰","智能家居","体感车","无人机"]
        }, {
            title: '电子教育',
            items: ["学生平板","点读机/笔","早教益智","录音笔","电纸书","电子词典","复读机","翻译机"]
        }]
    }
}, {
    title: ['电脑', '办公'],
    content: {
        tabs: ['玩3C','电脑办公','企业采购','GAME+','装机大师','企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本","游戏本","平板电脑","台式机","一体机","服务器/工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器","CPU","主板","显卡","硬盘","内存","机箱","电源","散热器","显示器支架","刻录机/光驱","声卡/扩展卡","装机配件","SSD固态硬盘","组装电脑","USB分线器","主板CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标","键盘","键鼠套装","网络仪表仪器","U盘","移动硬盘","鼠标垫","摄像头","线缆","手写板","硬盘盒","电脑工具","电脑清洁","UPS电源","插座","平板电脑配件","笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机","游戏耳机","手柄/方向盘","游戏软件","游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器","网络机顶盒","交换机","网络存储","网卡","5G/4G上网","网线","网络配件"]
        }, {
            title: '办公设备',
            items: ["投影配件","打印机","传真设备","显示器支架","验钞/点钞机","扫描设备","复合机","碎纸机","考勤门禁","收银机","会议音频视频","保险柜","装订/封装机","安防监控白板"]
        }, {
            title: '文具',
            items: ["笔类","本册/便签","办公文具","文件收纳","学生文具","计算器","画具画材","财会用品","文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓","墨粉","墨盒","色带","纸类","刻录光盘"]
        }, {
            title: '服务产品',
            items: ["延保服务","上门安装","维修保养","电脑软件"]
        }]
    }
},{
    title: ['家居', '家具','家装',' 厨具'],
    content: {
        tabs: ['家装城', '居家日用', '精品家居','家装建材','国际厨具','装修服务'],
        subs: [{
            title: '厨具',
            items: ["水具酒具","烹饪锅具","炒锅","碗碟套装","厨房配件","刀剪菜板","锅具套装","茶具","咖啡具","保温杯","厨房置物架"]
        }, {
            title: '家纺',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        }, {
            title: '生活用品',
            items: ["四件套","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        }, {
            title: '家装软饰',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        },  {
            title: '家居',
            items: ["床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        }, {
            title: '全屋定制',
            items: ["定制衣柜","榻榻米","橱柜门室","内门","防盗门窗"]
        }, {
            title: '建筑材料',
            items: ["油漆涂料", "涂刷辅料","瓷砖","地板","壁纸","强化地板","美缝剂","防水涂料","管材管件","木材/板材"]
        }, {
            title: '厨房卫浴',
            items: ["水槽","龙头","淋浴花洒","马桶","智能马桶","智能马桶盖","厨卫挂件","浴室柜","浴霸","集成吊顶","垃圾处理器"]
        }, {
            title: '五金店工',
            items: ["指纹锁","电动工具","手动工具","测量工具","工具箱","劳防用品","开关插座","配电箱/断路器" ,"机械锁拉手"]
        }, {
            title: '装修设计',
            items: ["装修 ","半包装修 ","家装设计","高端设计 ","局部装修 ","安装服务 ","装修公司 ","旧房翻新"]
        }]
    }
},{
    title: ['男装', '女装','童装','内衣'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
},{
    title: ['美妆', '个人清洁','宠物'],
    content: {
        tabs: ['玩3C','手机频道','网上营业厅','配件频道','智能数码','影响Club'],
        subs: [{
            title: '手机通讯',
            items: ["手机游戏","5G手机","拍照手机","全面屏手机","老人机","对讲机","以旧换新","手机维修"]
        }, {
            title: '运行商',
            items: ["合约机","手机卡","宽带","充话费/流量","中国电信","中国移动","中国联通","京东通信","找靓号"]
        }, {
            title: '手机配件',
            items: ["手机壳","贴膜","手机存储卡","数据线","充电器","手机","耳机","创意配件","手机饰品","手机电池","苹果周边","移动电源","蓝牙耳机","手机支架","拍照配件"]
        }, {
            title: '摄影摄像',
            items: ["数码相机","微单相机","单反相机","拍立得","运动相机","摄像机镜头","户外器材","影棚器材","冲印服务","数码相框"]
        }, {
            title: '数码配件',
            items: ["存储卡","三脚架/云台","相机包","滤镜","闪光灯/手柄","相机清洁/贴膜","机身附件","镜头附件","读卡器","支架","电池/充电器"]
        },  {
            title: '电子教育',
            items: ["学生平板","点读机/笔","早教益智","录音笔","电纸书","电子词典","复读机","翻译机"]
        }]
    }
},{
    title: ['女装', '鞋包','钟表','珠宝'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
},{
    title: ['男鞋', '运动','户外'],
    content: {
        tabs: ['家用电馆','家电专卖店','家电服务','企业采购','商用电器','以旧换新'],
        subs: [{
            title: '电视',
            items: ["超薄电视","全面屏电视","智能电视","教育电视","OLED电视","智慧屏","4K超清电视","55英寸","65英寸","电视配件"]
        }, {
            title: '洗衣机',
            items: ["滚筒洗衣机", "洗烘—体机","波轮洗衣机","迷你洗衣机","烘干机","洗衣机配件"]
        }, {
            title: '冰箱',
            items: ["多门","对开门","三门","双门","冷柜/冰吧","酒柜","冰箱配件"]
        }, {
            title: '厨卫大电',
            items: ["油烟机","燃气灶","烟灶套装","集成灶","消毒柜","洗碗机","电热水器","燃气热水器","空气能热水器","太阳能热水器","嵌入式厨电","烟机灶具配件"]
        }, {
            title: '厨卫小电',
            items: ["破壁机","电烤箱","电饭煲","电压力锅","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机/原汁机","电水壶/热水瓶","微波炉","电热饭盒","电火锅养生壶","电磁炉","面包机","空气炸锅","面条机","电陶炉","煮蛋器","电烧烤炉"]
        }, {
            title: '生活电器',
            items: ["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件"]
        }, {
            title: '各户健康',
            items: ["剃须刀", "电动牙刷", "电吹风", "美容仪", "美容仪", "洁面仪","按摩器","健康秤卷","直发器剃","脱毛器","理发器","足浴盆","足疗机","按摩椅"]
        }]
    }
},{
    title: ['房产', '汽车','汽车用品'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
},{
    title: ['母婴', '玩具乐器'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
},{
    title: ['食品', '酒类','生鲜','特产'],
    content: {
        tabs: ['玩3C','手机频道','网上营业厅','配件频道','智能数码','影响Club'],
        subs: [{
            title: '手机通讯',
            items: ["手机游戏","5G手机","拍照手机","全面屏手机","老人机","对讲机","以旧换新","手机维修"]
        },  {
            title: '手机配件',
            items: ["手机壳","贴膜","手机存储卡","数据线","充电器","手机","耳机","创意配件","手机饰品","手机电池","苹果周边","移动电源","蓝牙耳机","手机支架","拍照配件"]
        }, {
            title: '摄影摄像',
            items: ["数码相机","微单相机","单反相机","拍立得","运动相机","摄像机镜头","户外器材","影棚器材","冲印服务","数码相框"]
        }, {
            title: '数码配件',
            items: ["存储卡","三脚架/云台","相机包","滤镜","闪光灯/手柄","相机清洁/贴膜","机身附件","镜头附件","读卡器","支架","电池/充电器"]
        }, {
            title: '影音娱乐',
            items: ["耳机/耳麦","音箱/音响","智能音箱","收音机","麦克风","MP3/MP4","专业音频","音频线"]
        }, {
            title: '智能设备',
            items: ["智能手环","智能手表","智能眼镜","智能机器人","运动跟踪器","健康监测","智能配饰","智能家居","体感车","无人机"]
        }, {
            title: '电子教育',
            items: ["学生平板","点读机/笔","早教益智","录音笔","电纸书","电子词典","复读机","翻译机"]
        }]
    }
},{
    title: ['艺术', '礼品鲜花','农资绿植'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
},{
    title: ['医药保健', '计生情趣'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
},{
    title: ['图书', '文娱','教育','电子书'],
    content: {
        tabs: ['玩3C','手机频道','网上营业厅','配件频道','智能数码','影响Club'],
        subs: [{
            title: '手机通讯',
            items: ["手机游戏","5G手机","拍照手机","全面屏手机","老人机","对讲机","以旧换新","手机维修"]
        }, {
            title: '运行商',
            items: ["合约机","手机卡","宽带","充话费/流量","中国电信","中国移动","中国联通","京东通信","找靓号"]
        }, {
            title: '摄影摄像',
            items: ["数码相机","微单相机","单反相机","拍立得","运动相机","摄像机镜头","户外器材","影棚器材","冲印服务","数码相框"]
        }, {
            title: '数码配件',
            items: ["存储卡","三脚架/云台","相机包","滤镜","闪光灯/手柄","相机清洁/贴膜","机身附件","镜头附件","读卡器","支架","电池/充电器"]
        }, {
            title: '影音娱乐',
            items: ["耳机/耳麦","音箱/音响","智能音箱","收音机","麦克风","MP3/MP4","专业音频","音频线"]
        }, {
            title: '智能设备',
            items: ["智能手环","智能手表","智能眼镜","智能机器人","运动跟踪器","健康监测","智能配饰","智能家居","体感车","无人机"]
        }, {
            title: '电子教育',
            items: ["学生平板","点读机/笔","早教益智","录音笔","电纸书","电子词典","复读机","翻译机"]
        }]
    }
},{
    title: ['机票', '酒店','旅游','生活'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
},{
    title: ['理财', '众筹','白条', '保险'],
    content: {
        tabs: ['家装城', '居家日用', '精品家居','家装建材','国际厨具','装修服务'],
        subs: [{
            title: '厨具',
            items: ["水具酒具","烹饪锅具","炒锅","碗碟套装","厨房配件","刀剪菜板","锅具套装","茶具","咖啡具","保温杯","厨房置物架"]
        }, {
            title: '家纺',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        }, {
            title: '生活用品',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        }, {
            title: '家装软饰',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        }, {
            title: '灯具',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        },  {
            title: '建筑材料',
            items: ["油漆涂料", "涂刷辅料","瓷砖","地板","壁纸","强化地板","美缝剂","防水涂料","管材管件","木材/板材"]
        }, {
            title: '厨房卫浴',
            items: ["水槽","龙头","淋浴花洒","马桶","智能马桶","智能马桶盖","厨卫挂件","浴室柜","浴霸","集成吊顶","垃圾处理器"]
        }, {
            title: '五金店工',
            items: ["指纹锁","电动工具","手动工具","测量工具","工具箱","劳防用品","开关插座","配电箱/断路器" ,"机械锁拉手"]
        }, {
            title: '装修设计',
            items: ["装修 ","半包装修 ","家装设计","高端设计 ","局部装修 ","安装服务 ","装修公司 ","旧房翻新"]
        }]
    }
},{
    title: ['安装', '装修','清洗','二手'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
},{
    title: ['工业品'],
    content: {
        tabs: ['家装城', '居家日用', '精品家居','家装建材','国际厨具','装修服务'],
        subs: [{
            title: '厨具',
            items: ["水具酒具","烹饪锅具","炒锅","碗碟套装","厨房配件","刀剪菜板","锅具套装","茶具","咖啡具","保温杯","厨房置物架"]
        }, {
            title: '家纺',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        }, {
            title: '生活用品',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        }, {
            title: '家装软饰',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        }, {
            title: '灯具',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        }, {
            title: '家居',
            items: ["四件套","被子","枕芯","毛巾蚊帐","凉席","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾","枕套","沙发垫","坐垫桌布/罩件"]
        },  {
            title: '五金店工',
            items: ["指纹锁","电动工具","手动工具","测量工具","工具箱","劳防用品","开关插座","配电箱/断路器" ,"机械锁拉手"]
        }, {
            title: '装修设计',
            items: ["装修 ","半包装修 ","家装设计","高端设计 ","局部装修 ","安装服务 ","装修公司 ","旧房翻新"]
        }]
    }
}];

// 创建左侧导航条元素
function createMenuDom(menuList) {
    //     <li>
    //     <a href="#">家用电器</a>
    // </li>
    // <li>
    //     <a href="#">手机</a>
    //     <span>/</span>
    //     <a href="#">运营商</a>
    // </li>
    // 添加导航条内dom元素
    menuList.forEach(function (liData) {
        var oLi = $('<li></li>');
        var title = liData.title;
        // 添加导航条每行的tab数据
        for (var i = 0; i < title.length; i++) {
            $('<a href="#">' + title[i] + '</a>').appendTo(oLi);
            if (i != title.length - 1) {
                $('<span>/</span>').appendTo(oLi);
            }
        }
        $('#menu-list').append(oLi);
    });
}

createMenuDom(menuList);

var timer = null;
// 左侧导航列表添加鼠标移入事件
function bindMenuEvent() {
    $('#menu-list').on('mouseenter', 'li', function (e) {
        clearTimeout(timer);
        $(this).css({
            backgroundColor: '#eee',
        });
        var index = $(this).index();
        renderMenuContent(menuList[index].content);
        $('#menu-content').show();
    }).on('mouseleave', 'li', function (e) {
        $(this).css({
            backgroundColor: '#fff',
        });
        timer = setTimeout(function () {
            $('#menu-content').hide();
        }, 500)
    });
    $('#menu-content').on('mouseenter', function () {
        clearTimeout(timer);
    }).on('mouseleave', function () {
        timer = setTimeout(function () {
            $('#menu-content').hide();
        }, 500)
    })
}
// 渲染左侧导航对应的内容区
function renderMenuContent(data) {
    // <ul class="tabs">
    //     <li>家电馆</li>
    //     <li>镇乡专卖店</li>
    //     <li>家电服务</li>
    // </ul>
    // <div class="item-content">
    //     <dl>
    //         <dt>电视</dt>
    //         <dd>
    //             <a href="#">曲面电视</a>
    //             <a href="#">超薄电视</a>
    //             <a href="#">OLED电视</a>
    //             <a href="#">4K超清电视</a>
    //             <a href="#">55英寸</a>
    //             <a href="#">65英寸</a><a href="#">电视配件</a></dd>
    //     </dl>
    // </div> 
    $('#menu-content').html('');
    var tabs = data.tabs;
    var subs = data.subs;
    var oUl = $('<ul class="tabs"></ul>');
    var itemContentDiv = $('<div class="item-content"></div>');
    tabs.forEach(function (item) {
        $('<li>' + item + '</li>').appendTo(oUl);
    });
    subs.forEach(function (item) {
        var oDl = $('<dl></dl>');
        $('<dt>' + item.title + '</dt>').appendTo(oDl);
        var oDd = $('<dd></dd>');
        item.items.forEach(function (ele) {
            $('<a href="#">' + ele + '</a>').appendTo(oDd);
        });
        oDl.append(oDd).appendTo(itemContentDiv);
    });
    $('#menu-content').append(oUl).append(itemContentDiv);

}

bindMenuEvent();


$('#swiper').swiper({
    imgList: ['https://img1.360buyimg.com/pop/jfs/t1/34441/17/1285/197831/5cb463ebEe81f91c3/4600bf8a8baf704c.jpg',
        'https://m.360buyimg.com/babel/jfs/t1/37133/26/2273/30169/5cb594f2E3b91bb43/822488aa1d7b031e.jpg', 'https://img1.360buyimg.com/da/jfs/t1/37440/29/1488/102221/5cb52c56E454e4f66/383fac3e1d70d495.jpg',
        'https://m.360buyimg.com/babel/jfs/t1/32341/26/11683/46759/5cb58102E544717ff/5d06d34c2c7b1c34.jpg'],
    isAuto: true,
    animateType: 'fade'

});
// 右侧图标鼠标移入切换事件
function bindShowServiceEvent() {
    $('.item-frame').on('mouseenter', function (e) {
        $('.item-frame').removeClass('active');
        $('.service').addClass('service-extend');
        $(this).addClass('active');

    });
}
bindShowServiceEvent();
// 右侧图标区域点击关闭按钮切换图标
$('#close').click(function () {
    $('.item-frame').removeClass('active');
    $('.service').removeClass('service-extend');
    $('.item-frame').off('mouseenter');
    setTimeout(function () {
        bindShowServiceEvent();
    }, 600)
});


// 搜索按钮的点击事件 
$('#search-btn').click(function () {
    var val = $('#search-inp').val()
    $.ajax({
        url: 'https://suggest.taobao.com/sug',
        data: {
            code: 'utf-8',
            q: val,
            callback: 'dealData'
        },
        dataType: 'jsonp',
    })
});
// 渲染搜索框结果列表
function dealData(data) {
    console.log(data);
    $('#shelper').empty();
    data = data.result;
    data.forEach(function (item) {
        $('<li>' + item[0] + '</li>').appendTo($('#shelper'));
    })
    $('#shelper').show();
}
//  防抖
var searchTimer = null;
// 搜索框输入事件
$('#search-inp').keyup(function (e) {
    clearTimeout(searchTimer);
    searchTimer = setTimeout(function () {
        $('#search-btn').trigger('click');
    }, 300);
});
$('.search-box').mouseleave(function () {
    $('#shelper').hide();
}).click(function () {
    if($('#search-inp').val()) {
        $('#shelper').show();
    }  
}).find('#search-inp').focus(function (e) { 
    e.preventDefault();
    if($('#search-inp').val()) {
        $('#shelper').show();
    }  
});





$('.sk-mid').swiper({
    imgList: ['https://img11.360buyimg.com/mobilecms/s140x140_jfs/t1/19664/22/5029/146200/5c371ce7Ed88243bf/4050a27c714dd4f5.jpg!q90.webp',
        'https://img11.360buyimg.com/mobilecms/s140x140_jfs/t1/3445/3/12562/298328/5bd42169Edabf8535/6c3b5d81eb86b462.jpg!q90.webp',
        'https://img11.360buyimg.com/mobilecms/s140x140_jfs/t1/24602/40/14233/166462/5ca57073E385a8e7c/b314d226c4216c99.png!q90.webp',
        'https://img11.360buyimg.com/mobilecms/s140x140_jfs/t26674/132/1799437842/185954/e68a4b67/5bee21edN5ec04279.jpg!q90.webp'],
    isAuto: false,
    showImgWidth: 800,
    imgWidth: 200,
    animateType: 'animate',
});
$('.sk-right').swiper({
    imgList: ['https://img10.360buyimg.com/mobilecms/s180x260_jfs/t1/32935/40/11374/44668/5cb44a54Eb764ca0f/29020ab3d74cbd59.jpg!q90!cc_180x260',
        'https://img30.360buyimg.com/mobilecms/s180x260_jfs/t1/37067/4/2601/77956/5cb6a21dE63a9c262/976ce73ec28a8898.jpg!q90!cc_180x260',
    ],
    isAuto: true,
    animateType: 'animate',

});